#+TITLE: Largest Prime Factor
#+AUTHOR: 8dcc
#+OPTIONS: toc:2
#+STARTUP: nofold
#+PROPERTY: header-args:C      :tangle prime-factor.c :flags -std=c99 -Wall -Wextra -Wpedantic
#+PROPERTY: header-args:scheme :tangle prime-factor.scm

* Problem

Problem link: [[https://projecteuler.net/problem=3][Click me]].

The prime factors of $13195$ are $5, 7, 13$ and $29$.

What is the largest prime factor of the number $600851475143$?

* C code

#+begin_src C
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#define MAX_FACTORS 50

uint64_t largest_prime_factor(uint64_t target) {
    static uint64_t factors[MAX_FACTORS];
    int factors_pos = 0;

    for (uint64_t n = 2; n <= target; n++) {
        bool is_prime = true;
        for (int i = 0; i < factors_pos; i++) {
            if (n % factors[i] == 0) {
                is_prime = false;
                break;
            }
        }

        if (!is_prime)
            continue;

        if (target % n == 0) {
            factors[factors_pos++] = n;
            target /= n;
        }
    }

    return (factors_pos <= 0) ? target : factors[factors_pos - 1];
}

int main(void) {
    const uint64_t target = 600851475143;

    const uint64_t result = largest_prime_factor(target);
    printf("Result: %ld\n", result);

    return 0;
}
#+end_src

#+RESULTS:
: Result: 6857

* Scheme version

#+begin_src scheme
;; Returns #t if ELEMENT is in LIST. Returns #f otherwise.
(define (member? element list)
  (cond ((null? list) #f)
        ((equal? element (car list)) #t)
        (else (member? element (cdr list)))))

;; Returns prime factors of TARGET in descending order.
(define (prime-factors target)
  (define (prime-factors-recur target i list)
    (cond ((> i target)
           list)
          ((and (not (member? i list))
                (zero? (modulo target i)))
           (prime-factors-recur (/ target i)
                                (+ i 1)
                                (cons i list)))
          (else
           (prime-factors-recur target (+ i 1) list))))
  (prime-factors-recur target 2 '()))

(car (prime-factors 600851475143))
#+end_src

#+RESULTS:
: 6857
